app/views/shared/_navbar.html.erb

          <ul class="dropdown-menu">
            <% if (current_user && !current_user.orders.empty?) %>
---
SELECT  1 AS one FROM "orders" WHERE "orders"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ?  [["user_id", 1]]