app/views/orders/_order.html.erb

SELECT "relations".* FROM "relations" WHERE "relations"."order_id" = ?  [["order_id", 3]]
---
	<div class='row' id='relations'>
		<% order.relations.each do |relation| %>