app/views/items/_item.html.erb

		            <% end %>
	                <span id="item-<%= item.id %>-likesize" class='like-count'><%= item.get_likes.size %></span>
---
SELECT COUNT(*) FROM "items"

		<div class='row'>
			<% item.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."item_id" = ?  [["item_id", 1]]