app/controllers/comments_controller.rb

  def new
    @comment=Comment.new(item_id: params[:item_id])
    @item=Item.find(params[:item_id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? ORDER BY "items"."id" ASC LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def create
    @comment=Comment.new(comment_params)

    respond_to do |format|
      if @comment.save!
---
INSERT INTO "comments" ("content", "user_id", "item_id", "created_at", "updated_at", "attachment") VALUES (?, ?, ?, ?, ?, ?)  [["content", "Che za nah?"], ["user_id", 1], ["item_id", 7], ["created_at", "2018-01-05 13:02:55.216989"], ["updated_at", "2018-01-05 13:02:55.216989"], ["attachment", "images.jpg"]]

  def update
    respond_to do |format|
      if @comment.update(comment_params)
---
UPDATE "comments" SET "content" = ?, "attachment" = ?, "updated_at" = ? WHERE "comments"."id" = ?

  def destroy
    @comment.destroy!
---
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 2]]