app/controllers/items_controller.rb

  def index
    @items=Item.all.page(params[:page]).order('created_at DESC')
---
SELECT  "items".* FROM "items" ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "items"

  def create
    @item=Item.new(item_params)
    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("availability", "name", "cost", "information", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["availability", "t"], ["name", "Car"], ["cost", 2000], ["information", "Good car"], ["created_at", "2018-01-02 11:31:40.935249"], ["updated_at", "2018-01-02 11:31:40.935249"]]

  def update
    respond_to do |format|
      if @item.update(item_params)
---
UPDATE "items" SET "cost" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["cost", 3000], ["updated_at", "2018-01-03 10:09:41.549726"], ["id", 11]]