app/controllers/orders_controller.rb

  def create
    @order=Order.create(order_params)
---
INSERT INTO "orders" ("user_id", "created_at", "updated_at", "name") VALUES (?, ?, ?, ?)  [["user_id", 1], ["created_at", "2018-01-05 16:58:03.541198"], ["updated_at", "2018-01-05 16:58:03.541198"], ["name", "aaassssddd"]]