app/controllers/relations_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ?  [["user_id", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def new
    @relation=Relation.new(item_id: params[:item_id])
    @orders=current_user.orders
    @item=Item.find(params[:item_id])

INSERT INTO "relations" ("message", "quantity", "user_id", "item_id", "order_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["message", "No wishes"], ["quantity", 5], ["user_id", 1], ["item_id", 13], ["order_id", 9], ["created_at", "2018-01-05 22:46:42.091883"], ["updated_at", "2018-01-05 22:46:42.091883"]]
---
  def create
    @relation=Relation.new(relation_params)
    respond_to do |format|
      if @relation.save!

DELETE FROM "relations" WHERE "relations"."id" = ?  [["id", 1]]
---
  def destroy
    @relation.destroy

SELECT  "relations".* FROM "relations" WHERE "relations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_relation
      @relation=Relation.find(params[:id])