app/controllers/users_controller.rb

UPDATE "users" SET "avatar" = ?, "phone_number" = ?, "adress" = ?, "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["avatar", "download__1_.jpg"], ["phone_number", ""], ["adress", ""], ["name", ""], ["updated_at", "2018-01-05 12:19:00.695742"], ["id", 1]]
---
  def update
    if @user.update(account_update_params)